MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18876/mcu.h
// Register: CWG3CON0
#define CWG3CON0 CWG3CON0
extern volatile unsigned char           CWG3CON0            __at(0x690);
#ifndef _LIB_BUILD
asm("CWG3CON0 equ 0690h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned                        :3;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned G3EN                   :1;
    };
    struct {
        unsigned CWG3MODE               :3;
        unsigned                        :3;
        unsigned CWG3LD                 :1;
        unsigned CWG3EN                 :1;
    };
    struct {
        unsigned CWG3MODE0              :1;
        unsigned CWG3MODE1              :1;
        unsigned CWG3MODE2              :1;
    };
} CWG3CON0bits_t;
extern volatile CWG3CON0bits_t CWG3CON0bits __at(0x690);
// bitfield macros
#define _CWG3CON0_MODE_POSN                                 0x0
#define _CWG3CON0_MODE_POSITION                             0x0
#define _CWG3CON0_MODE_SIZE                                 0x3
#define _CWG3CON0_MODE_LENGTH                               0x3
#define _CWG3CON0_MODE_MASK                                 0x7
#define _CWG3CON0_LD_POSN                                   0x6
#define _CWG3CON0_LD_POSITION                               0x6
#define _CWG3CON0_LD_SIZE                                   0x1
#define _CWG3CON0_LD_LENGTH                                 0x1
#define _CWG3CON0_LD_MASK                                   0x40
#define _CWG3CON0_EN_POSN                                   0x7
#define _CWG3CON0_EN_POSITION                               0x7
#define _CWG3CON0_EN_SIZE                                   0x1
#define _CWG3CON0_EN_LENGTH                                 0x1
#define _CWG3CON0_EN_MASK                                   0x80
#define _CWG3CON0_MODE0_POSN                                0x0
#define _CWG3CON0_MODE0_POSITION                            0x0
#define _CWG3CON0_MODE0_SIZE                                0x1
#define _CWG3CON0_MODE0_LENGTH                              0x1
#define _CWG3CON0_MODE0_MASK                                0x1
#define _CWG3CON0_MODE1_POSN                                0x1
#define _CWG3CON0_MODE1_POSITION                            0x1
#define _CWG3CON0_MODE1_SIZE                                0x1
#define _CWG3CON0_MODE1_LENGTH                              0x1
#define _CWG3CON0_MODE1_MASK                                0x2
#define _CWG3CON0_MODE2_POSN                                0x2
#define _CWG3CON0_MODE2_POSITION                            0x2
#define _CWG3CON0_MODE2_SIZE                                0x1
#define _CWG3CON0_MODE2_LENGTH                              0x1
#define _CWG3CON0_MODE2_MASK                                0x4
#define _CWG3CON0_G3EN_POSN                                 0x7
#define _CWG3CON0_G3EN_POSITION                             0x7
#define _CWG3CON0_G3EN_SIZE                                 0x1
#define _CWG3CON0_G3EN_LENGTH                               0x1
#define _CWG3CON0_G3EN_MASK                                 0x80
#define _CWG3CON0_CWG3MODE_POSN                             0x0
#define _CWG3CON0_CWG3MODE_POSITION                         0x0
#define _CWG3CON0_CWG3MODE_SIZE                             0x3
#define _CWG3CON0_CWG3MODE_LENGTH                           0x3
#define _CWG3CON0_CWG3MODE_MASK                             0x7
#define _CWG3CON0_CWG3LD_POSN                               0x6
#define _CWG3CON0_CWG3LD_POSITION                           0x6
#define _CWG3CON0_CWG3LD_SIZE                               0x1
#define _CWG3CON0_CWG3LD_LENGTH                             0x1
#define _CWG3CON0_CWG3LD_MASK                               0x40
#define _CWG3CON0_CWG3EN_POSN                               0x7
#define _CWG3CON0_CWG3EN_POSITION                           0x7
#define _CWG3CON0_CWG3EN_SIZE                               0x1
#define _CWG3CON0_CWG3EN_LENGTH                             0x1
#define _CWG3CON0_CWG3EN_MASK                               0x80
#define _CWG3CON0_CWG3MODE0_POSN                            0x0
#define _CWG3CON0_CWG3MODE0_POSITION                        0x0
#define _CWG3CON0_CWG3MODE0_SIZE                            0x1
#define _CWG3CON0_CWG3MODE0_LENGTH                          0x1
#define _CWG3CON0_CWG3MODE0_MASK                            0x1
#define _CWG3CON0_CWG3MODE1_POSN                            0x1
#define _CWG3CON0_CWG3MODE1_POSITION                        0x1
#define _CWG3CON0_CWG3MODE1_SIZE                            0x1
#define _CWG3CON0_CWG3MODE1_LENGTH                          0x1
#define _CWG3CON0_CWG3MODE1_MASK                            0x2
#define _CWG3CON0_CWG3MODE2_POSN                            0x2
#define _CWG3CON0_CWG3MODE2_POSITION                        0x2
#define _CWG3CON0_CWG3MODE2_SIZE                            0x1
#define _CWG3CON0_CWG3MODE2_LENGTH                          0x1
#define _CWG3CON0_CWG3MODE2_MASK                            0x4

// Register: CWG3CON1
#define CWG3CON1 CWG3CON1
extern volatile unsigned char           CWG3CON1            __at(0x691);
#ifndef _LIB_BUILD
asm("CWG3CON1 equ 0691h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :1;
        unsigned IN                     :1;
    };
    struct {
        unsigned CWG3POLA               :1;
        unsigned CWG3POLB               :1;
        unsigned CWG3POLC               :1;
        unsigned CWG3POLD               :1;
        unsigned                        :1;
        unsigned CWG3IN                 :1;
    };
} CWG3CON1bits_t;
